Autodesk.Revit.DB.Frame.Transform(Autodesk.Revit.DB.Transform)
Applies the input transform to this frame.
trf:
The transform to apply to the frame.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
this operation failed.
Since:
2012

Autodesk.Revit.DB.Frame.CanDefineRevitGeometry(Autodesk.Revit.DB.Frame)
Tests whether the supplied Frame object may be used to define a Revit curve or surface.
In order to satisfy the requirements the Frame must be orthonormal
and its origin is expected to lie within the Revit design limits Autodesk.Revit.DB.XYZ.IsWithinLengthLimits(Autodesk.Revit.DB.XYZ).
Remarks:
Certain Revit curve and surface types are defined using a local frame of reference.
frameOfReference:
Frame to be validated.
Returns:
True if this Frame may be used as a local frame of reference, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2017

Autodesk.Revit.DB.Frame.BasisZ
The third basis vector of the frame.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.Frame.BasisY
The second basis vector of the frame.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.Frame.BasisX
The first basis vector of the frame.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.Frame.Origin
The frame's base point.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.Frame.#ctor(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ)
Constructor that takes the frame's base point and three basis vectors.
origin:
The frame's base point.
vec1:
The frame's first basis vector.
vec2:
The frame's second basis vector.
vec3:
The frame's third basis vector.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012